#include "p33FJ128GP706.h"
//#include "main\pic18f4550.h" 	//названия регистров\битов введенные вручную

#include "system\menu\menu_proc.h"

////---------переменные--------------
unsigned char error_num=0;

//----------функции----------------
void error_out(void);
void menu_error_refresh(void);


//--------------------------основная часть-------------------------------------------

///////////////////////////////////
/*rom near*/ const unsigned char menu_error[]=
//	'--------------------'
//  '                    '
//  '    ОШИБКА N 001    '
//  '                    '
//  '                    '

// -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  - 
//  
 {__,__,__,__,__,__,__,__,__,__,__,__,__,__,__,__,__,__,__,__,

// -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  - 
//             О  Ш  И  Б  К  А     N     0  0  1 
  __,__,__,__,_O,SH,RI,RB,_K,_A,__,xN,__,__,__,__,__,__,__,__,

// -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  - 
//  
  __,__,__,__,__,__,__,__,__,__,__,__,__,__,__,__,__,__,__,__,

// -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  - 
//  
  __,__,__,__,__,__,__,__,__,__,__,__,__,__,__,__,__,__,__,__};

void error_out(void)
{
	//инициаллизация параметров меню
	menu_body_out(menu_error);
	menu_error_refresh();
//	bc(INTCON,GIEH);
//	bc(INTCON,GIEL);
	while(1);
	return;
}

///////////////////////////////////
void menu_error_refresh(void)
{
	//выводим текущий номер ошибки
	menu_variable_out(1,13,error_num,3);
	return;
}

